## Plan Result (sbox_finops_reporting - TerraformPlanApply)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.finopslogicapp-la-hmctssbox[0]
  * azurerm_role_assignment.finopslogicapp-sa
  * azurerm_user_assigned_identity.finopslogicapp-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.finopslogicapp-la-hmctssbox[0] will be created
  + resource "azurerm_role_assignment" "finopslogicapp-la-hmctssbox" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/oms-automation-rg/providers/Microsoft.OperationalInsights/workspaces/hmcts-sbox-law"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.finopslogicapp-sa will be created
  + resource "azurerm_role_assignment" "finopslogicapp-sa" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/finopsdatasboxrg/providers/Microsoft.Storage/storageAccounts/finopsdatasboxsa"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.finopslogicapp-mi will be created
  + resource "azurerm_user_assigned_identity" "finopslogicapp-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "finopslogicapp-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "finopsdatasboxrg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label sbox_finops_reporting - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/finops-reporting/issues/20/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Target":"sbox_finops_reporting - TerraformPlanApply","Vars":{}} -->